trade_exp/src/Documents/ВозвратВОборотИСМП/ВозвратВОборотИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fed06ebd-7382-42c7-a4a0-f0ee84c5220c">
  <name>ВозвратВОборотИСМП</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="771e1bcc-acf1-4e7c-9577-559cc8328043">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="74f0e9ad-b3e2-4f63-a54c-0a6898c1a286">
    <name>ВидПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2936b774-d9d1-431e-8d54-d1b10a46b9df">
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67a07004-7b53-4fd0-8f0b-9a2158f71fcc">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="291df3ac-83ac-45fd-ba02-b1a3ff2afd59">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60381ce8-5e10-46f6-b3a1-1a70a404a00a">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="db2d0a7c-0bca-49cb-aa55-be6e6e233f76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="1019d3d3-16ef-4973-bfdb-38c34ec6ab41">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f6bbecf4-c888-448e-9d3b-c7f2f1f207ee">
      <name>КодМаркировки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5e639247-ed42-4d45-a241-80a0834e50c8">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7314c3db-0e39-4d3e-8cf4-8682bc14d08d">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0e880e14-c99e-495a-a8e9-3b253d7e3f48">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ВидыОперацийИСМП/ВидыОперацийИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e9c1cafc-5f92-4c79-9670-4d59820b9385">
  <name>ВидыОперацийИСМП</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="4b878091-7ebf-4db3-933f-2da3007be5c3">
    <name>ВозвратВОборотПриРозничнойРеализации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2098f0fe-8a6e-4cd9-bcbf-538784ae4d28">
    <name>ВозвратВОборотПриДистанционномСпособеПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f5d86580-02ed-4585-8052-6fa6d695759e">
    <name>ВыводИзОборотаРозничнаяПродажа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f77499c0-74a7-4984-b8f0-e34d56a20f4b">
    <name>ВыводИзОборотаЭкспортВСтраныЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="98177ec7-4bf7-4102-af0a-0c1becbadbf6">
    <name>ВыводИзОборотаЭкспортЗаПределыСтранЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da7d181d-1c17-4f12-a895-2a86c962e6e6">
    <name>ВыводИзОборотаВозвратФизическомуЛицу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2a6d8ee4-5468-4efc-af44-0bf9367c6d85">
    <name>УдалитьВыводИзОборотаПродажаПоОбразцамДистанционнаяПродажа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7d58c805-ea68-428a-8451-0623c0bf2911">
    <name>ВыводИзОборотаУтратаПовреждениеТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="554f3f85-0dd4-487e-850b-6b82c07748e5">
    <name>ВыводИзОборотаУничтожениеТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a6b0ca2d-0d6b-4f00-aea8-7b26a9a8cbb7">
    <name>ВыводИзОборотаКонфискацияТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="318d16ff-4be3-4830-8b8c-31ab44ef4f56">
    <name>ВыводИзОборотаЛиквидацияПредприятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d9c32d23-ae7d-4a5e-b36f-07a055784043">
    <name>ВыводИзОборотаИспользованиеДляСобственныхНуждПредприятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ВозвратВОборотИСМП/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции	
//Удалить после обновления. Временные изменения по Маркировке
&ИзменениеИКонтроль("ВозвратВОборотJSON")
Функция Док_ВозвратВОборотJSON(ДокументСсылка, ДополнительныеПараметры = Неопределено)

	СообщенияJSON = Новый Массив;
	
	СписокЗапросов = Новый СписокЗначений;
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ИСМППрисоединенныеФайлы.ВладелецФайла КАК Ссылка,
	|	КОЛИЧЕСТВО(ИСМППрисоединенныеФайлы.Ссылка) КАК ПоследнийНомерВерсии
	|ПОМЕСТИТЬ Версии
	|ИЗ
	|	Справочник.ИСМППрисоединенныеФайлы КАК ИСМППрисоединенныеФайлы
	|ГДЕ
	|	ИСМППрисоединенныеФайлы.ВладелецФайла = &Ссылка
	|	И ИСМППрисоединенныеФайлы.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыЗапросовИС.Исходящий)
	|СГРУППИРОВАТЬ ПО
	|	ИСМППрисоединенныеФайлы.ВладелецФайла
	|");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	Шапка.Номер                              КАК Номер,
	|	Шапка.Дата                               КАК Дата,
	|	ЕСТЬNULL(Версии.ПоследнийНомерВерсии, 0) КАК ПоследнийНомерВерсии,
	|	Шапка.ДокументОснование                  КАК ДокументОснование,
	|
	|	Шапка.Организация                КАК Организация,
	|	Представление(Шапка.Организация) КАК ОрганизацияПредставление,
	|
	|	Шапка.Ответственный                КАК Ответственный,
	|	Представление(Шапка.Ответственный) КАК ОтветственныйПредставление,
	|
	|	Шапка.Операция                        КАК Операция,
	|	Шапка.ВидПродукции                    КАК ВидПродукции,
	|	Шапка.Ссылка                          КАК Ссылка
	|
	|ИЗ
	|	Документ.ВозвратВОборотИСМП КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Версии КАК Версии
	|		ПО Шапка.Ссылка = Версии.Ссылка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка",
	"Шапка");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	// Универсальные реквизиты
	|	Товары.Номенклатура   КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия          КАК Серия,
	|
	|	// Дополнительные реквизиты
	|	ЕСТЬNULL(Товары.КодМаркировки.ЗначениеШтрихкода, """") КАК КодМаркировки,
	|	Товары.Оплачен                                КАК Оплачен,
	|	
	|	Товары.ВидДокументаСертификации   КАК ВидДокументаСертификации,
	|	Товары.НомерДокументаСертификации КАК НомерДокументаСертификации,
	|	Товары.ДатаДокументаСертификации  КАК ДатаДокументаСертификации,
	|
	|	Товары.ВидПервичногоДокумента          КАК ВидПервичногоДокумента,
	|	Товары.НаименованиеПервичногоДокумента КАК НаименованиеПервичногоДокумента,
	|	Товары.НомерПервичногоДокумента        КАК НомерПервичногоДокумента,
	|	Товары.ДатаПервичногоДокумента         КАК ДатаПервичногоДокумента
	|ИЗ
	|	Документ.ВозвратВОборотИСМП.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|",
	"Товары");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	//@skip-warning
	Шапка  = РезультатЗапроса["Шапка"].Выбрать();
	//@skip-warning
	Товары = РезультатЗапроса["Товары"].Выгрузить();
	
	Если Не Шапка.Следующий()
		Или Товары.Количество() = 0 Тогда
		
		СообщениеJSON = ОбменДаннымиИСМП.СтруктураСообщенияJSON();
		СообщениеJSON.Организация = Шапка.Организация;
		СообщениеJSON.Документ    = ДокументСсылка;
		СообщениеJSON.Описание = ОбменДаннымиИСМП.ОписаниеОперацииПередачиДанных(
			Шапка.Операция, ДокументСсылка);
		СообщениеJSON.ТекстОшибки = НСтр("ru = 'Нет данных для выгрузки.'");
		СообщениеJSON.ТребуетсяПодписание = Ложь;
		СообщенияJSON.Добавить(СообщениеJSON);
		
		Возврат СообщенияJSON;
		
	КонецЕсли;
	
	НомерВерсии = Шапка.ПоследнийНомерВерсии + 1;
	
	СообщениеJSON = ОбменДаннымиИСМП.СтруктураСообщенияJSON();
	СообщениеJSON.Организация       = Шапка.Организация;
	СообщениеJSON.Документ          = ДокументСсылка;
	СообщениеJSON.ДокументОснование = Шапка.ДокументОснование;
	
	СообщениеJSON.Описание = ОбменДаннымиИСМП.ОписаниеОперацииПередачиДанных(
		Шапка.Операция, ДокументСсылка, НомерВерсии);
	
	РеквизитыОрганизации = РаботаСКонтрагентамиИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(Шапка.Организация);
	
	Если Не ЗначениеЗаполнено(РеквизитыОрганизации.ИНН) Тогда
		ОбщегоНазначенияИСКлиентСервер.ДобавитьТекстОшибки(
			СообщениеJSON,
			СтрШаблон(
				НСтр("ru = 'Не заполнено поле ""ИНН"" для организации %1'"), Шапка.Организация));
	КонецЕсли;
	
	ПараметрыНормализацииПрочее = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализацииПрочее.ИмяСвойстваКодМаркировки = "Штрихкод";
	ПараметрыНормализацииПрочее.НачинаетсяСоСкобки       = Ложь;
	
	ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
	ПользовательскиеПараметрыРазбораКодаМаркировки.ПроверятьАлфавитЭлементов = Ложь;
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("trade_participant_inn", РеквизитыОрганизации.ИНН);
	ТелоЗапроса.Вставить("return_type",           ИнтерфейсИСМПСлужебный.ВидВозвратаВОборот(Шапка.Операция));
	ТелоЗапроса.Вставить("products_list",         Новый Массив);
	
	Для Каждого СтрокаТЧТовары Из Товары Цикл
		
		СтрокаТЧ = Новый Структура;
		РезультатРазбора = ШтрихкодированиеОбщегоНазначенияИС.НоваяСтруктураОбработкиШтрихкода(
			СтрокаТЧТовары.КодМаркировки, Шапка.ВидПродукции, ПользовательскиеПараметрыРазбораКодаМаркировки);
		
		СтрокаТЧ.Вставить(
			"ki",
			ОбменДаннымиИСМП.КодМаркировкиДляПередачиИСМП(РезультатРазбора, ПараметрыНормализацииПрочее));
#Удаление  
        Если Шапка.Операция = Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриДистанционномСпособеПродажи Тогда
			СтрокаТЧ.Вставить("paid", СтрокаТЧТовары.Оплачен);
		КонецЕсли;
#КонецУдаления
		// Сертификация
		Если ЗначениеЗаполнено(СтрокаТЧТовары.ВидДокументаСертификации) Тогда
			СтрокаТЧ.Вставить("certificate_type",   ИнтерфейсИСМПОбщегоНазначения.ВидДокументаСертификации(СтрокаТЧТовары.ВидДокументаСертификации));
			СтрокаТЧ.Вставить("certificate_number", СтрокаТЧТовары.НомерДокументаСертификации);
			СтрокаТЧ.Вставить("certificate_date",   ИнтеграцияИС.ДатаUTC(СтрокаТЧТовары.ДатаДокументаСертификации));
		КонецЕсли;
#Вставка
		УказатьПервичныйДокумент = (СтрокаТЧТовары.Оплачен
			Или Шапка.Операция = Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриРозничнойРеализации);
#КонецВставки
		Если (СтрокаТЧТовары.Оплачен И Шапка.Операция = Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриДистанционномСпособеПродажи)
			Или Шапка.Операция = Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриРозничнойРеализации
			Или Шапка.Операция = Перечисления.ВидыОперацийИСМП.ВозвратВОборотТовараПриобретавшегосяНеДляПродажи Тогда
			СтрокаТЧ.Вставить(
				"primary_document_type",
				ИнтерфейсИСМПСлужебный.ВидПервичногоДокумента(СтрокаТЧТовары.ВидПервичногоДокумента));
			Если СтрокаТЧТовары.ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументовИСМП.Прочее Тогда
				СтрокаТЧ.Вставить("primary_document_custom_name", СтрокаТЧТовары.НаименованиеПервичногоДокумента);
			КонецЕсли;
			
			СтрокаТЧ.Вставить("primary_document_date",   ИнтеграцияИС.ДатаUTC(СтрокаТЧТовары.ДатаПервичногоДокумента));
			СтрокаТЧ.Вставить("primary_document_number", СтрокаТЧТовары.НомерПервичногоДокумента);
		КонецЕсли;
		
		ТелоЗапроса.products_list.Добавить(СтрокаТЧ);
		
	КонецЦикла;
	
	ТекстСообщенияJSON = ОбменДаннымиИСМПКлиентСервер.ОбъектВТекстJSON(ТелоЗапроса, Истина);
	
	СообщениеJSON.ТекстСообщенияJSON  = ТекстСообщенияJSON;
	СообщениеJSON.ТипСообщения        = Перечисления.ТипыЗапросовИС.Исходящий;
	СообщениеJSON.Версия              = НомерВерсии;
	СообщениеJSON.ТребуетсяПодписание = Истина;
	
	СообщениеJSON.Операция                  = Шапка.Операция;
	СообщениеJSON.Назначение                = Перечисления.НазначениеСообщенийИСМП.ИСМП;
	СообщениеJSON.СтанцияУправленияЗаказами = Неопределено;
	СообщениеJSON.ВидПродукции              = Шапка.ВидПродукции;
	
	СообщенияJSON.Добавить(СообщениеJSON);
	
	Возврат СообщенияJSON;

КонецФункции

Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт

Если ДопПараметры = Неопределено Тогда
	ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
КонецЕсли;

Если ТипЗнч(Документ) = Тип("ДокументОбъект.ВозвратВОборотИСМП") Тогда
	ДокументСсылка = Документ.Ссылка;
Иначе
	ДокументСсылка = Документ;
КонецЕсли;

Запрос			= Новый Запрос;
ТекстыЗапроса	= Новый СписокЗначений;

Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Док_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры, ДокументСсылка);
	
КонецЕсли;

////////////////////////////////////////////////////////////////////////////
// Получим таблицы для движений

Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);

КонецФункции

Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт

МеханизмыДокумента.Добавить("ДвижениеМаркированногоТовара"); 

КонецПроцедуры

Процедура Док_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
  	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
 
КонецПроцедуры

Функция ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект) экспорт
	ИмяРегистра = "ДвижениеМаркированногоТовара";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Штрихкоды.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Штрихкоды.Ссылка.Склад КАК Склад,
	|	Штрихкоды.Ссылка.Организация КАК Организация,
	|	Штрихкоды.КодМаркировки КАК Штрихкод,
	|	ШтрихкодыУпаковка.Ссылка КАК ШтрихкодУпаковки,
	|	1 КАК Количество
	|ИЗ
	|	Документ.ВозвратВОборотИСМП.Товары КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковка
	|		ПО Штрихкоды.КодМаркировки = ШтрихкодыУпаковка.Штрихкод
	|ГДЕ
	|	Штрихкоды.Ссылка = &Ссылка";
	//|	И ВЫБОР
	//|			КОГДА Штрихкоды.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	//|					И Штрихкоды.Ссылка.Дата >= Штрихкоды.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
	//|				ТОГДА ЛОЖЬ
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ";	
	
  	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти


#КонецЕсли
